In [38]:
import pandas as pd

In [39]:
data={'이름':['메로나','비비빅','죠스바'],
      '가격':[300,400,250],
      '재고':[20,3,100]}

In [40]:
dataDF=pd.DataFrame(data)

In [41]:
dataDF

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [42]:
print(dataDF.index)
print(dataDF.columns)
print(dataDF.dtypes)
print(dataDF.values)
print(dataDF.shape)
print(dataDF.ndim) # 차원수

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '가격', '재고'], dtype='object')
이름    object
가격     int64
재고     int64
dtype: object
[['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
(3, 3)
2

In [43]:
dataDF['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [44]:
dataDF[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [45]:
dataDF.loc[1,['가격','재고']]

가격    400
재고      3
Name: 1, dtype: object

In [46]:
dataDF.loc[[0,2],['가격','재고']]

    가격   재고
0  300   20
2  250  100

In [47]:
dataDF.index=['일','이','삼']

In [48]:
dataDF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [49]:
dataDF['총가격'] = 0

In [50]:
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [51]:
dataDF.loc['사']=['빵빠레',550,10,0]

In [52]:
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [53]:
dataDF.loc['이','재고']=23

In [54]:
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [55]:
data =[
    [2000, 3050, 2050, 1980],
    [7500, 2050, 2050, 1980],
    [15450, 15050, 1550, 14900]
]

In [56]:
dataDF=pd.DataFrame(
    data,
    columns=['시가','고가','저가','종가']
)

In [57]:
print(dataDF)

      시가     고가    저가     종가
0   2000   3050  2050   1980
1   7500   2050  2050   1980
2  15450  15050  1550  14900

In [58]:
print(dataDF.index)
print(dataDF.columns)
print(dataDF.dtypes)
print(dataDF.ndim)
print(dataDF.shape)
print(dataDF.values)

RangeIndex(start=0, stop=3, step=1)
Index(['시가', '고가', '저가', '종가'], dtype='object')
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
2
(3, 4)
[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050  1550 14900]]

In [59]:
dataDF

      시가     고가    저가     종가
0   2000   3050  2050   1980
1   7500   2050  2050   1980
2  15450  15050  1550  14900

In [60]:
dataDF.index=['2024-01-01','2024-02-01','2024-03-01']

In [61]:
dataDF

               시가     고가    저가     종가
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1550  14900

In [62]:
dataDF.columns=['Open','High','Low','Close']

In [63]:
dataDF

             Open   High   Low  Close
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1550  14900

In [64]:
dataDF.loc['2024-04-01']=[3200,3550,3000,2990]

In [65]:
dataDF

             Open   High   Low  Close
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1550  14900
2024-04-01   3200   3550  3000   2990

In [66]:
dataDF.drop('2024-01-01',axis=0,inplace=True)

In [67]:
dataDF

             Open   High   Low  Close
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1550  14900
2024-04-01   3200   3550  3000   2990

In [68]:
dataDF.loc['2024-03-01','Low']=14000

In [69]:
dataDF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [70]:
dataDF['Average']=0

In [71]:
dataDF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [72]:
dataDF['Total']=0

In [73]:
dataDF

             Open   High    Low  Close  Average  Total
2024-02-01   7500   2050   2050   1980        0      0
2024-03-01  15450  15050  14000  14900        0      0
2024-04-01   3200   3550   3000   2990        0      0

In [74]:
# 데이터
# 시리즈나 데이터프레임
# 시리즈
# 데이터프레임
#내부적으로 narry
# 시리즈
# 시리즈
# 데이터프레임